tutorials/compressible/PBNS/cpbnsLTS/RAEplane_M090_a1/constant/polyMesh/boundary
/*---------------------------------------------------------------------------*
Caelus 10.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "1/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

10
(
    wingL
    {
        type            patch;
        nFaces          13301;
        startFace       592159;
    }
    wingR
    {
        type            patch;
        nFaces          13260;
        startFace       605460;
    }
    tail
    {
        type            patch;
        nFaces          54;
        startFace       618720;
    }
    fuselage
    {
        type            patch;
        nFaces          14343;
        startFace       618774;
    }
    lateralL
    {
        type            patch;
        nFaces          166;
        startFace       633117;
    }
    lateralR
    {
        type            patch;
        nFaces          166;
        startFace       633283;
    }
    top
    {
        type            patch;
        nFaces          165;
        startFace       633449;
    }
    outlet
    {
        type            patch;
        nFaces          152;
        startFace       633614;
    }
    bottom
    {
        type            patch;
        nFaces          165;
        startFace       633766;
    }
    inlet
    {
        type            patch;
        nFaces          152;
        startFace       633931;
    }
)

// ************************************************************************* //
